# Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

# Step 2. Create 3 differents Series, each of length 100, as follows:

• The first a random number from 1 to 4
• The second a random number from 1 to 3
• The third a random number from 10,000 to 30,000

In [2]:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))

print(s1)

0     2
1     2
2     2
3     2
4     2
     ..
95    2
96    1
97    3
98    3
99    2
Length: 100, dtype: int32

In [3]:
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))

print(s2)

0     1
1     3
2     1
3     3
4     1
     ..
95    3
96    1
97    3
98    3
99    3
Length: 100, dtype: int32

In [4]:
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s3)

0     20230
1     25024
2     15931
3     25061
4     10256
      ...
95    26531
96    29063
97    10024
98    17101
99    24102
Length: 100, dtype: int32

# Step 3. Create a DataFrame by joinning the Series by column

In [5]:
housemarket = pd.concat([s1, s2, s3], axis=1)
housemarket.head()

   0  1      2
0  2  1  20230
1  2  3  25024
2  2  1  15931
3  2  3  25061
4  2  1  10256

# Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [6]:
housemarket.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
housemarket.head()

   bedrs  bathrs  price_sqr_meter
0      2       1            20230
1      2       3            25024
2      2       1            15931
3      2       3            25061
4      2       1            10256

# Step 5. Create a one column DataFrame with the values of the 3 Series and     assign it to 'bigcolumn'

In [7]:
# concatinating the values into one 
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# Transforming it to a DataFrame since its still in series
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

#Reference Used : https://datatofish.com/convert-pandas-series-to-dataframe/

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       2
2       2
3       2
4       2
..    ...
95  26531
96  29063
97  10024
98  17101
99  24102

[300 rows x 1 columns]

# Step 6. Ops it seems it is going only until index 99. Is it true?

NO, Eventhough the index shows upto 99 the length of the DataFrame is 300.

In [10]:
Length_DF = len(bigcolumn)
print("Length of the Data Frame : ", Length_DF)

Length of the Data Frame :  300

# Step 7. Reindex the DataFrame so it goes from 0 to 299

In [11]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

#Reference Used : https://stackoverflow.com/questions/20490274/how-to-reset-index-in-a-pandas-dataframe

         0
0        2
1        2
2        2
3        2
4        2
..     ...
295  26531
296  29063
297  10024
298  17101
299  24102

[300 rows x 1 columns]